/*!
 * Distpicker v1.0.4
 * https://github.com/fengyuanchen/distpicker
 *
 * Copyright (c) 2014-2016 Fengyuan Chen
 * Released under the MIT license
 *
 * Date: 2016-06-01T15:05:52.606Z
 */

(function (factory) {
  if (typeof define === 'function' && define.amd) {
    // AMD. Register as anonymous module.
    define('ChineseDistricts', [], factory);
  } else {
    // Browser globals.
    factory();
  }
})(function () {

  var ChineseDistricts = {
    86: {

      130000: '小学',
      140000: '小升初',
      210000: '初中',
      220000: '中考冲刺',
      230000: '高中',
      310000: '高考冲刺'          
    },
    
    130000: {
      130100: '一年级',
      130200: '二年级',
      130300: '三年级',
      130400: '四年级',
      130500: '五年级',
      130600: '六年级'

    },
    130100: {
      130102: '语文',
      130104: '数学',
      130105: '英语'    
    },
    130200: {
      130202: '语文',
      130203: '数学',
      130204: '英语'
      
    },
    130300: {
      130302: '语文',
      130303: '数学',
      130304: '英语'

    },
    130400: {
      130402: '语文',
      130403: '数学',
      130404: '英语'

    },
    130500: {
      130502: '语文',
      130503: '数学',
      130521: '英语'
     
    },
    130600: {
      130602: '语文',
      130606: '数学',
      130607: '英语'

    },
    
    140000: {
      140100: '小升初'

    },
    140100: {
      140105: '小升初'

    },
   
   
    210000: {
      210100: '预初',
      210200: '初一',
      210300: '初二',
      210400: '初三'

    },
    210100: {
      210102: '语文',
      210103: '数学',
      210104: '英语'

    },
    210200: {
      210202: '语文',
      210203: '数学',
      210204: '英语'

    },
    210300: {
      210302: '语文',
      210303: '数学',
      210304: '英语',
      210305: '物理'

    },
    210400: {
      210402: '语文',
      210403: '数学',
      210404: '英语',
      210405: '物理',
      210406: '化学'

    },
    
    220000: {
      220100: '中考冲刺',

    },
    220100: {
      220102: '语文',
      220103: '数学',
      220104: '英语',
      220105: '物理',
      220106: '化学'
    },
    
    230000: {
      230100: '高一',
      230200: '高二',
      230300: '高三'

    },
    230100: {
      230102: '语文',
      230103: '数学',
      230104: '英语',
      230108: '物理',
      230109: '化学'
     
    },
    230200: {
      230202: '语文',
      230203: '数学',
      230204: '英语',
      230205: '物理',
      230206: '化学'
      
    },
    230300: {
      230302: '语文',
      230303: '数学',
      230304: '英语',
      230305: '物理',
      230306: '化学'
    },
   
    310000: {
      310100: '高考冲刺'
    },
    310100: {
      310101: '语文',
      310104: '数学',
      310105: '英语',
      310106: '物理',
      310107: '化学'    
    },
   
   
    
    
   
     
   
  };

  if (typeof window !== 'undefined') {
    window.ChineseDistricts = ChineseDistricts;
  }

  return ChineseDistricts;

});
